In [1]:
!del sample.db

zsh:1: command not found: del

In [4]:
import sqlite3

# create the connectin object 
conn = sqlite3.connect("sample.db")

# create cursor 
cursor = conn.cursor()

In [5]:
create_table = """ 
                CREATE TABLE EMPLOYEE(
                FIRST_NAME CHAR(20) NOT NULL,
                LAST_NAME CHAR(20),
                AGE INT NOT NULL,
                SEX CHAR(1),
                INCOME FLOAT)
                """

# execute the ddl 
cursor.execute(create_table)
conn.commit()


# fetch all the records 
cursor.fetchall()

[]

In [6]:
# insert data into database in single shot
insertion_command = """
INSERT INTO EMPLOYEE (FIRST_NAME,LAST_NAME, AGE,SEX,INCOME)
VALUES 
('John','snow','M', NULL ,50000.0),
('RAJAN','GHIMIRE','M', 25 ,550000.0),
('NAJAR','GHIMIRE','M', 25 ,550000.0);
"""
# execute the ddl 
cursor.execute(insertion_command)
conn.commit()

In [7]:
# get the entries from the first column
cursor.execute("SELECT * from EMPLOYEE")

In [8]:
for x in cursor:
    print(x)

('John', 'snow', 'M', None, 50000.0)
('RAJAN', 'GHIMIRE', 'M', '25', 550000.0)
('NAJAR', 'GHIMIRE', 'M', '25', 550000.0)

**Execute Many**

In [9]:
data = [
  ("Prajwal","Luitel",23,"M",15000000),
  ("Sambridhi","Luitel",23,"F",15000000)
]

stmt = "INSERT INTO EMPLOYEE (FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) VALUES (?, ?, ?, ?, ?)"
cursor.executemany(stmt, data)
conn.commit()

In [10]:
# get the entries from the first column
cursor.execute("SELECT * from EMPLOYEE")
# for x in cursor:
#     print(x)

In [11]:
cursor.fetchone()

('John', 'snow', 'M', None, 50000.0)

In [12]:
cursor.fetchall()

[('RAJAN', 'GHIMIRE', 'M', '25', 550000.0),
 ('NAJAR', 'GHIMIRE', 'M', '25', 550000.0),
 ('Prajwal', 'Luitel', 23, 'M', 15000000.0),
 ('Sambridhi', 'Luitel', 23, 'F', 15000000.0)]

**Update**

In [13]:
sql = """UPDATE EMPLOYEE SET AGE=AGE+1 WHERE SEX='M'"""
cursor.execute(sql)
conn.commit()


cursor.execute("SELECT * from EMPLOYEE")
for x in cursor:
    print(x)

('John', 'snow', 'M', None, 50000.0)
('RAJAN', 'GHIMIRE', 'M', '25', 550000.0)
('NAJAR', 'GHIMIRE', 'M', '25', 550000.0)
('Prajwal', 'Luitel', 24, 'M', 15000000.0)
('Sambridhi', 'Luitel', 23, 'F', 15000000.0)

**Extra Questions:**

In [ ]:
# rename column sex to gender. 
cursor.execute('''ALTER TABLE EMPLOYEE RENAME COLUMN SEX TO GENDER''')
conn.commit()

# rename the whole table 
cursor.execute("""ALTER TABLE EMPLOYEE RENAME TO Employee_UPDATED""")
conn.commit()

**DELETE DATA**

In [ ]:
# delete record where Sambridhi
delete_query = """DELETE FROM Employee_UPDATED WHERE FIRST_NAME = 'Sambridhi'"""
# execute the cooman
cursor.execute(delete_query)

conn.commit()

# select from the table
cursor.execute("SELECT * from Employee_UPDATED")

cursor.fetchall()

In [2]:
import sqlite3

# Connect to the database
# conn = sqlite3.connect('example.db')
conn = sqlite3.connect(':memory:')

# create cursor 

cursor = conn.cursor()

# Create the EMPLOYEE table
create_table = ''' 
CREATE TABLE IF NOT EXISTS EMPLOYEE(
    FIRST_NAME CHAR(20) NOT NULL,
    LAST_NAME CHAR(20),
    AGE INT NOT NULL,
    SEX CHAR(1),
    INCOME FLOAT
)
'''
cursor.execute(create_table)
conn.commit()

In [4]:
insertion = """INSERT INTO EMPLOYEE (FIRST_NAME, LAST_NAME, AGE, SEX, INCOME)
            VALUES (?, ?, ?, ?, ?)
            """
            
cursor.execute(insertion, ("Rajan", "Ghimire", 20, "M", 17000000))

In [5]:
conn.commit()

In [10]:
selection = "SELECT * FROM EMPLOYEE WHERE EMPLOYEE.FIRST_NAME = ?"
cursor.execute(selection, ("Rajan",))

In [11]:
cursor.fetchall()

[('Rajan', 'Ghimire', 20, 'M', 17000000.0)]

In [12]:
update_command = """UPDATE EMPLOYEE SET AGE = ? WHERE FIRST_NAME = ?"""
cursor.execute(update_command, (25, "Rajan"))
conn.commit()

selection = "SELECT * FROM EMPLOYEE WHERE EMPLOYEE.FIRST_NAME = ?"
cursor.execute(selection, ("Rajan",))
cursor.fetchall()

[('Rajan', 'Ghimire', 25, 'M', 17000000.0)]

In [13]:
            
cursor.execute(insertion, ("Zajan", "Ghimire", 20, "M", 17000000))

In [14]:
conn.commit()

In [15]:
cursor.execute("DELETE FROM EMPLOYEE WHERE FIRST_NAME = ?", ("Zajan",))

selection = "SELECT * FROM EMPLOYEE"
cursor.fetchall()

[]

In [16]:
# Verify the deletion
cursor.execute('SELECT * FROM EMPLOYEE')
records = cursor.fetchall()
for record in records:
    print(record)

('Rajan', 'Ghimire', 25, 'M', 17000000.0)

In [ ]:
""""
ALTER TABLE EMPLOYEE RENAME COLUMN SEX TO GENDER 
ALTER TABLE EMPLOYEE RENAME TO EMPLOYEE_UPDATED

"""